/* NSKeyValueValidationError, user entered a value which was invalid for a field */
"Err1024-C" = "유효하지 않은 값.";

/* NSKeyValueValidationError, argument is a string or number which was invalid for entry into a field */
"Err1024.o" = " “%@ ”값이 유효하지 않습니다.";

/* NSFormattingError */
"Err2048-C" = "포맷 오류.";

/* NSFileLockingError */
"Err255-C" = "파일을 잠글 수 없습니다.";

/* NSFileLockingError */
"Err255-R" = "파일이 이미 잠겨있거나, 잠그는데 필요한 접근 권한이 없을 수도 있습니다.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "“%@” 파일을 잠글 수 없습니다.";

/* NSFileReadUnknownError */
"Err256" = "파일을 열 수 없습니다.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "“%@” 파일을 열 수 없습니다.";

/* NSFileReadNoPermissionError */
"Err257" = "적절한 접근 권한이 없기 때문에 파일을 열 수 없습니다.";

/* NSFileReadNoPermissionError */
"Err257-C" = "적절한 접근 권한이 없습니다.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "접근 권한을 보거나 변경하려면, Finder에서 항목을 선택하고 파일 > 정보 입수를 선택하십시오.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "적절한 접근 권한이 없기 때문에 “%@” 파일을 열 수 없습니다.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "유효하지 않은 파일 이름.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "파일 이름 “%@”이(가) 유효하지 않기 때문에 파일을 열 수 없습니다.";

/* NSFileReadCorruptFileError */
"Err259" = "올바른 포맷이 아니므로 파일을 열 수 없습니다.";

/* NSFileReadCorruptFileError */
"Err259-C" = "파일이 올바른 포맷이 아닙니다.";

/* NSFileReadCorruptFileError */
"Err259-R" = "파일이 손상되었거나, 불완전하거나, 알려진 포맷과 다를 수 있습니다.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "올바른 포맷이 아니기 때문에 “%@” 파일을 열 수 없습니다.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "해당 파일이 존재하지 않습니다.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "“%@” 파일이 존재하지 않습니다.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "지정된 텍스트 인코딩을 사용하여 해당 파일을 열 수 없습니다.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "지정된 텍스트 인코딩이 적용되지 않습니다.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "%@ 텍스트 인코딩이 적용되지 않습니다.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "파일이 다른 텍스트 인코딩을 사용하여 저장되었거나, 텍스트 파일이 아닐 수 있습니다.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "%@ 텍스트 인코딩을 사용하여 해당 파일을 열 수 없습니다.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "%1$@ 텍스트 인코딩을 사용하여 “%2$@” 파일을 열 수 없습니다.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "지정된 URL 유형이 지원되지 않기 때문에 파일을 열 수 없습니다.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "지정된 URL 유형이 지원되지 않습니다.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "%2$@ URL 유형이 지원되지 않기 때문에 “%1$@” 파일을 열 수 없습니다.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "%@ URL 유형이 지원되지 않기 때문에 파일을 열 수 없습니다.";

/* NSFileReadTooLargeError */
"Err263" = "파일이 너무 크기 때문에 열 수 없습니다.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "파일이 너무 큽니다.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "파일이 너무 크기 때문에 “%@” 파일을 열 수 없습니다.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "컨텐츠의 텍스트 인코딩을 결정할 수 없기 때문에 해당 파일을 열 수 없습니다.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "컨텐츠의 텍스트 인코딩을 결정할 수 없습니다.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "텍스트 인코딩을 명확하게 지정하면 해당 파일이 열릴 수도 있습니다.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "컨텐츠의 텍스트 인코딩을 결정할 수 없기 때문에 “%@” 파일을 열 수 없습니다.";

/* NSUserCancelledError */
"Err3072-C" = "작업이 취소되었습니다.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "“%@”을(를) 제거할 수 없습니다.";

/* NSFileNoSuchFileError */
"Err4-C" = "해당 파일이 존재하지 않습니다.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "“%@” 파일이 존재하지 않습니다.";

/* NSFileWriteUnknownError */
"Err512" = "해당 파일을 저장할 수 없습니다.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "“%1$@”을(를) “%2$@”(으)로 복사할 수 없습니다.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "“%1$@”을(를) “%2$@”(으)로 링크할 수 없습니다.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "“%1$@”을(를) “%2$@”(으)로 이동할 수 없습니다.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "“%@”을(를) 제거할 수 없습니다.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "“%2$@” 파일을 “%1$@” 폴더에 저장할 수 없습니다.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "“%@” 파일을 저장할 수 없습니다.";

/* NSFileWriteNoPermissionError */
"Err513" = "적절한 접근 권한이 없기 때문에 파일을 저장할 수 없습니다.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "“%2$@”에 대한 적절한 접근 권한이 없기 때문에 “%1$@”을(를) 복사할 수 없습니다.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "“%2$@”에 대한 적절한 접근 권한이 없기 때문에 “%1$@”을(를) 링크할 수 없습니다.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "“%2$@”에 대한 적절한 접근 권한이 없기 때문에 “%1$@”을(를) 이동할 수 없습니다.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "적절한 접근 권한이 없기 때문에 “%@”을(를) 제거할 수 없습니다.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "적절한 접근 권한이 없습니다.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "접근 권한을 보거나 변경하려면, Finder에서 항목을 선택하고 파일 > 정보 입수를 선택하십시오.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "“%1$@” 폴더에 “%2$@” 파일을 저장할 적절한 접근 권한이 없습니다.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "“%@” 파일을 저장할 적절한 접근 권한이 없습니다.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "파일 이름이 유효하지 않기 때문에 파일을 저장할 수 없습니다.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "파일 이름 “%@”이(가) 유효하지 않기 때문에 해당 파일을 제거할 수 없습니다.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "유효하지 않은 파일 이름.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "파일 이름 “%@”이(가) 유효하지 않기 때문에 해당 파일을 저장할 수 없습니다.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "지정된 텍스트 인코딩을 사용하여 해당 파일을 저장할 수 없습니다.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "지정된 텍스트 인코딩이 적용되지 않습니다.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "%@ 텍스트 인코딩이 적용되지 않습니다.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "가능하면 다른 텍스트 인코딩을 선택하십시오.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "%@ 텍스트 인코딩을 사용하여 해당 파일을 저장할 수 없습니다.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "%1$@ 텍스트 인코딩을 사용하여 “%2$@” 파일을 저장할 수 없습니다.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "지정된 URL 유형이 지원되지 않기 때문에 파일을 저장할 수 없습니다.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "지정된 URL 유형이 지원되지 않습니다.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "%2$@ URL 유형이 지원되지 않기 때문에 “%1$@” 파일을 저장할 수 없습니다.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "%@ URL 유형이 지원되지 않기 때문에 파일을 저장할 수 없습니다.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "충분한 공간이 없기 때문에 파일을 저장할 수 없습니다.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "충분한 공간이 없기 때문에 “%1$@”을(를) “%2$@”(으)로 복사할 수 없습니다.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "충분한 공간이 없기 때문에 “%1$@”을(를) “%2$@”(으)로 링크할 수 없습니다.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "충분한 공간이 없기 때문에 “%1$@”을(를) “%2$@”(으)로 이동할 수 없습니다.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "충분한 공간이 없습니다.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "“%@” 볼륨에 공간이 부족합니다.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "볼륨의 일부 파일을 삭제한 다음 다시 시도하십시오.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "충분한 공간이 없기 때문에 “%@” 파일을 저장할 수 없습니다.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "“%2$@” 볼륨에 공간이 부족하기 때문에 “%1$@” 파일을 저장할 수 없습니다.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"Operation could not be completed. (%@ error %ld.)" = "작업을 완료할 수 없습니다.(%1$@ 오류 %2$ld.)";

